tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
tap "yakitrak/yakitrak"
brew "jpeg-xl"
brew "bat"
brew "coreutils"
brew "docker", link: false
brew "openssl@1.1"
brew "dotnet@6"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libarchive"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "tcl-tk"
brew "git-gui"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "gzip"
brew "jq"
brew "krb5"
brew "libpq"
brew "libssh"
brew "lsd"
brew "luv"
brew "make"
brew "maven"
brew "python@3.11"
brew "neovim"
brew "node"
brew "nuget"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openvpn"
brew "qemu"
brew "podman"
brew "postgresql@14"
brew "postgresql@15"
brew "python@3.9"
brew "ripgrep"
brew "s3cmd"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "yarn"
brew "yt-dlp"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"
brew "yakitrak/yakitrak/obs"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "arc"
cask "datagrip"
cask "discord"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "macfuse"
cask "microsoft-teams"
cask "mpv"
cask "ngrok"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "visual-studio-code"
vscode "ahmadalli.vscode-nginx-conf"
vscode "Angular.ng-template"
vscode "cyrilletuzi.angular-schematics"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eg2.vscode-npm-script"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "hbenl.vscode-jasmine-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "Ionide.Ionide-fsharp"
vscode "johnpapa.angular-essentials"
vscode "johnpapa.Angular2"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "jsaulou.theme-by-language"
vscode "mathiasfrohlich.Kotlin"
vscode "mhutchie.git-graph"
vscode "mnxn.fsharp-fsl-fsy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "raynigon.nginx-formatter"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "trinm1709.dracula-theme-from-intellij"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.JasmineSnippets"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zerodind.familiar-java-themes"
